// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.

// Например, задан массив:

// 1 4 7 2

// 5 9 2 3

// 8 4 2 4

// 5 2 6 7

// Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка


using System;

class Program {
    static void Main() {
        int[,] array = { { 1, 4, 7, 2 }, { 5, 9, 2, 3 }, { 8, 4, 2, 4 }, { 5, 2, 6, 7 } };
        int minSum = int.MaxValue; // начальное значение для поиска наименьшей суммы
        int minIndex = -1; // индекс строки с наименьшей суммой

        for (int i = 0; i < array.GetLength(0); i++) { // проходим по каждой строке
            int sum = 0;
            for (int j = 0; j < array.GetLength(1); j++) { // считаем сумму элементов в строке
                sum += array[i, j];
            }
            if (sum < minSum) { // если сумма меньше текущей наименьшей
                minSum = sum;
                minIndex = i;
            }
        }

        // выводим результат на экран
        Console.WriteLine("Номер строки с наименьшей суммой элементов: " + (minIndex + 1));
    }
}